app/Controllers/Home.php

    public function submit()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('daftar_tamu');

        $validation = $this->validate([
            'nama' => 'required|min_length[3]',
            'no_hp' => 'required|min_length[10]|max_length[13]',
            'keperluan' => 'required|min_length[5]',
            'dengan' => 'required|min_length[5]'
        ]);

        if (!$validation) {
            session()->setFlashdata('gagal', 'Periksa kembali inputan anda. Mohon input data dengan benar.');
            return redirect()->to(base_url('/'));
        } else {
            $data = [
                'nama' => $this->request->getVar('nama'),
                'no_hp' => $this->request->getVar('no_hp'),
                'keperluan' => $this->request->getVar('keperluan'),
                'dengan' => $this->request->getVar('dengan')
            ];

            $builder->insert($data);
---
INSERT INTO `daftar_tamu` (`nama`, `no_hp`, `keperluan`, `dengan`) VALUES ('Qonita', '08123567890', 'Ambil raport', 'NURJANAH, S.Pd')

    public function rekap()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('daftar_tamu');

        $get = $builder->orderBy('tanggal', 'DESC')->get()->getResult();
---
SELECT *
FROM `daftar_tamu`
ORDER BY `tanggal` DESC

    public function export()
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('daftar_tamu');

        $get = $builder->orderBy('tanggal', 'DESC')->get()->getResult();
---
SELECT *
FROM `daftar_tamu`
ORDER BY `tanggal` DESC